package com.skypro.java.petshelterbot.message;

public class botOutMessages {
    //Консультация с новым пользователем
    private static final String newUserMessage1 = "Здравствуй дорой друг." +
            "Ты попал в самый уникальный приют  в мире," +
            "у тебя есть уникальная возможность совершить добрый поступок," +
            "и стать обладателем домашнего питомца ";
    private static final String newUserMessage2 = "Наш приют содержит более 1000 питомцев," +
            "которые каждый день получают самую лушую заботу в мире," +
            "ещё наш приют обладает сервисом  помощи нашим подопечным," +
            "прислать Вашу помощь  можно на номер 8 (54545)-5858-67858 ";
    private static final String newUserMessage3 = "Наш приют работает каждый день с 8:00 до 20:00.Мы находимся г Москва, ул Приютная,1 проезд, строение 2 ";
    private static final String newUserMessage4 = "На территории приюта действуют следующие правила," +
            "1 Нельзя курить " +
            "2 Нельзя распивать алкогольные напитки " +
            "3 Нельзя мусорить " +
            "4 Нельзя сувать руки к животным";
    private static final String newUserMessage5 = "Перед тем как  вы возьмёте питомца вы должны оставить свои контакные данные ";
    private static final String newUserMessage6 = "Если вы не получили нужную информацию можете обратиться к волонтёру ";

    //Консультация с потенциальным хозяином животного из приюта
    private static final String potentialAnimalOwnerMessage7 = "Вы находитесь в меню инфы про то как стать владельцем питомца";
    private static final String potentialAnimalOwnerMessage8 = "Правила знакомства с собакой,прежде чем взять питомца из приюта " +
            "Вам нужно познакомиться с питомцем и привыкнуть друг к другу " +
            "для этого необходимо, каждый день посещять приют" +
            "и кормить питомца всякими вкусняшками   ";
    private static final String potentialAnimalOwnerMessage9 = "Список документов, необходимых для того, чтобы взять собаку из приюта." +
            "1 Паспорт " +
            "2 Рекомендации от 5 лучших друзей";
    private static final String potentialAnimalOwnerMessage10 = " Рекомендаций по транспортировке животного." +
            "1 Обязательно питомца нужно вести в клетке или на повадке  ";
    private static final String potentialAnimalOwnerMessage11 = "Список рекомендаций по обустройству дома для щенка." +
            "1 поставить миску" +
            "2 добавить место для сна" +
            "3 положить кость  ";
    private static final String potentialAnimalOwnerMessage12 = "Список рекомендаций по обустройству дома для взрослой собаки. " +
            "1 Крепкая цепь " +
            "2 Большая конура " +
            "3 Много еды ";
    private static final String potentialAnimalOwnerMessage13 = " Список рекомендаций по обустройству места для питомца" +
            "дома для собаки с ограниченными возможностями (зрение, передвижение).  ";
    private static final String potentialAnimalOwnerMessage14 = " Советы кинолога по первичному общению с собакой. ";
    private static final String potentialAnimalOwnerMessage15 = " Выдать рекомендации по проверенным кинологам для дальнейшего обращения к ним. ";
    private static final String potentialAnimalOwnerMessage16 = " Список вопросов к будущему хозяину питомца" +
            "1 В частный дом или квартиру хотите взять собаку; " +
            "2 Есть ли опыт содержания собак " +
            "3  От чего умерла прежняя собака/собаки и сколько было ей лет " +
            "4  Как часто выгуливают собаку (если собаку берут для содержания на цепи в будке или в вольере);" +
            "5  Сколько лет человеку (если у собеседника молодой голос);" +
            "6  Есть ли маленькие дети (если берут собаку в квартиру);" +
            "7  Согласны ли другие члены семьи появлению собаки; " +
            "8  Живут люди в собственном или съемном жилье;" +
            "9  Как относятся люди к самовыгулу собак.";
    private static final String potentialAnimalOwnerMessage17 = "Почему могут отказать в передаче питомца" +
            "1 Берут животное на подарок ребенку или члену семьи (бывают исключения);" +
            "2 Наличие маленьких детей и отсутствие опыта содержания собак и одиноким молодым мамам тоже откажем;" +
            "3 Съемное жилье" +
            "4 Если люди раздраженно или грубо отвечают на вопросы;" +
            "5 Если люди, еще не взяв собаку, просят у нас и поводок и ошейник и цепь и будку, так как у них нет денег на это;" +
            "6 Если у человека было много животных и человек не скажет, причины их исчезновения;" +
            "7 Лояльное отношение к самовыгулу собак;" +
            "8 Если люди передаривали своих бывших животных по просьбе друзей/родственников;" +
            "9 Если люди с легкостью и не задумываясь отвечают на все наши вопросы и согласны на все наши условия," +
            " при этом не задавая своих вопросов (чаще это молодые люди в возрасте 18 + лет); " +
            "10 Если после передачи собаки выяснится, что люди ввели нас в заблуждение (обманули), то животное мы забираем обратно;";
    private static final String potentialAnimalOwnerMessage18 = " Вам нужно оставить номер для дальнейших контактов 8(87978)-90-90-7979 ";
    private static final String potentialAnimalOwnerMessage19 = " Если вы не получили нужную информацию можете обратиться к волонтёру ";

    //Ведение питомца
    private static final String petManagementMessage20 = " Заполните  форму ежедневного отчета. ";
    private static final String petManagementMessage21 = "Вы прислали  только фото, нужно прислать ещё писменный отчёт.  ";
    private static final String petManagementMessage22 = "Вы прислали только отчёт,нужно добавить ещё и фото.  ";
    private static final String petManagementMessage23 = " Предупреждаем Вас о том ,что  вы плохо  заполняете отчёт  (делает волонтер): \n" + "  " +
            "Дорогой усыновитель, мы заметили, что ты заполняешь отчет не так подробно, как необходимо. Пожалуйста, подойди ответственнее " +
            "к  этому занятию. В противном случае волонтеры приюта будут обязаны самолично проверять условия содержания собаки";
    private static final String petManagementMessage24 = "Вы успешно прошли успешно испытательный срок, Поздравляем Вас!!!!! теперь на Вас большая ответственность не подведите ";
    private static final String petManagementMessage25 = " Вам назначенн дополнительный испытательный срок " + "столько дней" + " " + "вам назначенно";
    private static final String petManagementMessage26 = " Вы не справелись извините,сделайте выводы и подумайте над поведением";
    private static final String petManagementMessage27 = " Если вы не получили нужную информацию можете обратиться к волонтёру ";


}
